# File watching
brew "watch"

# Databases
brew "sqlite"

# JavaScript / JSON
brew "jq"

# Python
brew "python"
brew "python3"
brew "python-launcher"
brew "readline"

# Shell
brew "zsh"
brew "shellcheck"

# File editing
brew "neovim"
brew "tree-sitter"

# Git[Hub]
brew "gh"
brew "git"
brew "git-lfs"
brew "pre-commit"

# Networking
brew "curl"
brew "httpie"
cask "ngrok"
brew "wget"

# Build tools
cask "cmake"

# General CLI tools
brew "adr-tools"
brew "asciinema"
brew "awscli"
brew "bat"
brew "colordiff"
brew "cookiecutter"
brew "ctags"
brew "datasette"
brew "devd"
brew "difftastic"
brew "direnv"
brew "fd"
brew "fzf"
brew "gnupg"
brew "helm"
brew "htop"
brew "proselint"
brew "ripgrep"
brew "tree"
brew "xz"
brew "yq"
brew "zoxide"
brew "zstd"

# Caches
brew "redis"

# Compression
brew "brotli"
brew "zlib"

# Image and text libraries
brew "cairo"
brew "graphviz"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "libpng"
brew "pango"
brew "webp"

# Libraries
brew "libxml2"

# Security
cask "keepassxc"

# Productivity
cask "alfred"
brew "starship"
