# Casks
tap "caskroom/cask"

# File watching
brew "modd"
brew "watch"

# Databases
brew "sqlite"

# JavaScript / JSON
brew "jq"

# Python
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "python3"
brew "readline"

# Ruby
brew "ruby"

# Shell
brew "zsh"

# File editing
brew "vim"

# General CLI tools
brew "ack"
brew "asciinema"
brew "bat"
brew "ccat"
brew "ctags"
brew "direnv"
brew "git"
brew "gnupg"
brew "httpie"
brew "kubernetes-helm"
brew "proselint"
brew "tox"
brew "tree"
brew "wget"
brew "xz"

# Security
cask "keepassxc"
