# Casks
tap "caskroom/cask"

# File watching
brew "modd"
brew "watch"

# Databases
brew "sqlite"

# JavaScript / JSON
brew "jq"

# Python
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "python3"
brew "readline"

# Ruby
brew "ruby"

# Shell
brew "zsh"

# File editing
brew "vim"

# General CLI tools
brew "ack"
brew "asciinema"
brew "awscli"
brew "bat"
brew "cookiecutter"
brew "ctags"
brew "curl"
brew "direnv"
brew "git"
brew "gnupg"
brew "graphviz"
brew "helm"
brew "httpie"
brew "htop"
brew "modd"
cask "ngrok"
brew "pre-commit"
brew "proselint"
brew "the_silver_searcher"
brew "tox"
brew "tree"
brew "watch"
brew "wget"
brew "xz"
brew "zlib"

# Security
cask "keepassxc"
